Revit 2027 API
BuiltInFailures.StairRampFailures.CannotCreateNosing Property
 Can't create nosing on one or more treads.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateNosing { get; }
Public Shared ReadOnly Property CannotCreateNosing As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateNosing {
	FailureDefinitionId^ get ();
}
static member CannotCreateNosing : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace